# Created 2020-03-01 Sun 22:38
#+OPTIONS: toc:nil d:nil
#+OPTIONS: toc:nil d:nil
#+TITLE: PythonCheatSheet
#+AUTHOR: [[https://alhassy.github.io/][Musa Al-hassy]]
#+export_file_name: README.org

Quick reference to a tremendously accessible high-level language ---executable pseudocode!

*The listing sheet, as PDF, can be found
 [[https://alhassy.github.io/PythonCheatSheet/CheatSheet.pdf][here]]*,
 or as a [[https://alhassy.github.io/PythonCheatSheet/CheatSheet_Portrait.pdf][single column portrait]],
 while below is an unruly html rendition.

This reference sheet is built from a
[[https://github.com/alhassy/CheatSheet][CheatSheets with Org-mode]]
system.

#+toc: headlines 2
#+macro: blurb Quick reference to a tremendously accessible high-level language ---executable pseudocode!

#+latex_header: \usepackage{titling,parskip}
#+latex_header: \usepackage{eufrak} % for mathfrak fonts
#+latex_header: \usepackage{multicol,xparse,newunicodechar}

#+latex_header: \usepackage{etoolbox}

#+latex_header: \newif\iflandscape
#+latex_header: \landscapetrue

#+latex_header_extra: \iflandscape \usepackage[landscape, margin=0.5in]{geometry} \else \usepackage[margin=0.5in]{geometry} \fi

#+latex_header: \def\cheatsheetcols{2}
#+latex_header: \AfterEndPreamble{\begin{multicols}{\cheatsheetcols}}
#+latex_header: \AtEndDocument{ \end{multicols} }

#+latex_header: \let\multicolmulticols\multicols
#+latex_header: \let\endmulticolmulticols\endmulticols
#+latex_header: \RenewDocumentEnvironment{multicols}{mO{}}{\ifnum#1=1 #2 \def\columnbreak{} \else \multicolmulticols{#1}[#2] \fi}{\ifnum#1=1 \else \endmulticolmulticols\fi}

#+latex_header: \def\maketitle{}
#+latex: \fontsize{9}{10}\selectfont

#+latex_header: \def\cheatsheeturl{}

#+latex_header: \usepackage[dvipsnames]{xcolor} % named colours
#+latex: \definecolor{grey}{rgb}{0.5,0.5,0.5}

#+latex_header: \usepackage{color}
#+latex_header: \definecolor{darkgreen}{rgb}{0.0, 0.3, 0.1}
#+latex_header: \definecolor{darkblue}{rgb}{0.0, 0.1, 0.3}
* Functions

#+latex: \hspace{-1.3em}
/Functions are first-class citizens/: Python has one namespace for functions and
variables, and so there is no special syntax to pass functions around or to use
them anywhere, such as storing them in lists.

- src_python[:exports code]{return} clauses are optional; if there are none, a
  function returns src_python[:exports code]{None}.

- Function application always requires parentheses, even when there are no
  arguments.

- Any object ~x~ can be treated like a function, and use the ~x(⋯)~ application
  syntax, if it implements the ~__call__~ method: ~x(⋯) ≈ x.__call__(⋯)~.  The
  src_python[:exports code]{callable} predicate indicates whether an object is
  callable or not.

- Functions, and classes, can be nested without any special syntax; the nested
  functions are just new local values that happen to be functions. Indeed,
  nested functions can be done with src_python[:exports code]{def} or with
  assignment and src_python[:exports code]{lambda}.

- Functions can receive a variable number of arguments using ~*~.

#+begin_src python :results output :session compose
def compose(*fs):
    """Given many functions f₀,…,fₙ return a new one: λ x. f₀(⋯(fₙ(x))⋯)"""
    def seq(x):
        seq.parts = [f.__name__ for f in fs]
        for f in reversed(fs):
            x = f(x)
        return x
    return seq

print (help(compose))  # ⇒ Shows the docstring with function type
compose.__doc__ = "Dynamically changing docstrings!"

# Apply the “compose” function;
# first define two argument functions in two ways.

g = lambda x: x + 1
def f(x): print(x)

h = compose(f, g, int)
h('3')                         # ⇒ Prints 4
print(h.parts)                 # ⇒ ['f', '<lambda>', 'int']
print (h.__code__.co_argcount) # ⇒ 1; h takes 1 argument!

# Redefine “f” from being a function to being an integer.
f = 3
# f(1) # ⇒ Error: “f” is not a function anymore!
#+end_src

#+results:
: Help on function compose in module __main__:
:
: compose(*fs)
:     Given f₀,…,fₙ return λ x ↦ f₀(⋯(fₙ(x))⋯)
:
: None
: 4
: ['f', '<lambda>', 'int']
: 1


Note that ~compose()~ is just the identity function ~lambda x∶ x~.
** Currying

*Currying*: Fixing some arguments ahead of time.

#+begin_parallel
#+latex: \vspace{0em}
#+begin_src python
   partial(f, v₀, …, vₙ)
≈ lambda x₀, …, xₘ:
    f(v₀, …, vₙ, x₀, …, xₘ)
#+end_src

#+latex: \columnbreak
#+begin_src python
from functools import partial

multiply  = lambda x, y, z: z * y + x
twice     = partial(multiply, 0, 2)
assert 10 == twice(5)
#+end_src

#+results:
#+end_parallel

Using decorators and classes, we can make an ‘improved’ partial application
mechanism ---see the final page.

** Curry Decorator

#+latex: \ifnum\cheatsheetcols=1 \else \columnbreak \vspace{-1em} \fi
| *Example: Currying via Class Decoration* |

#+latex: \vspace{-0.5em}
Goal: We want to apply functions in many ways, such as ~f(x₁, …, xₙ)~
and ~f(x₁, …, xᵢ)(xᵢ₊₁, …, xₙ)~; i.e., all the calls on the right below
are equivalent.
#+latex: \vspace{-0.5em}

#+begin_parallel
#+begin_src python :session curry
@curry
def doit(x, y, z):
    print('got', x, y, z)
#+end_src
#+latex: \columnbreak
#+begin_src python :session curry
doit(1)(2)(3)
doit(1, 2)(3)
doit(1)(2, 3)
doit(1, 2, 3)
doit(1, 2, 3, 666, '∞') # Ignore extra args
#+end_src
#+end_parallel

#+latex: \vspace{-1.5em}
The simplest thing to do is to transform src_python[:exports code]{f = lambda
x₁, …, xₙ: body} into src_python[:exports code]{nestLambdas(f, [],
f.__code__.co_argcount) = lambda x₁: …: lambda xₙ: body}.
#+begin_src python :session curry
def nestLambdas (func, args, remaining):
   if remaining == 0: return func(*args)
   else: return lambda x: nestLambdas(func, args + [x], remaining - 1)
#+end_src

#+results:

#+latex: \vspace{-0.5em}

However, the calls shift from ~f(v₁, …, vₖ)~ to ~f(v₁)(v₂)⋯(vₖ)~; so we need to
change what it means to call a function.
As already mentioned, we cannot extend built-in classes,
so we'll make a wrapper to slightly alter what it means to
call a function on a smaller than necessary amount of arguments.

#+latex: \vspace{-0.5em}
#+begin_src python :session curry
class PartiallyAppliedFunction():

    def __init__(self, func):
        self.value = nestLambdas(func, [], func.__code__.co_argcount)

    def __mul__ (self, other):
        return PartiallyAppliedFunction(lambda x: self(other(x)))

    apply = lambda self, other: other * self if callable(other) else self(other)
    def __rshift__(self, other):  return self.apply(other)
    def __rrshift__(self, other): return self.apply(other)

    def __call__(self, *args):
        value = self.value
        for a in args:
            if callable(value):
                value = value(a)
        return PartiallyAppliedFunction(value) if (callable(value)) else value

curry = PartiallyAppliedFunction   # Shorter convenience name
#+end_src

#+results:

The above invocation styles, for ~doit~, now all work ^_^

Multiplication now denotes function composition and the [[https://docs.python.org/3/reference/datamodel.html#object.__rsub__][(‘r’eflected)
‘r’ight-shift]] denotes forward-composition/application:
| ~(g * f(v₁, …, vₘ))(x₁, …, xₙ) = g(f (v₁, …, vₘ, x₁))(x₂, …, xₙ)~ |
#+latex: \vspace{-0.5em}

#+begin_parallel
#+begin_src python :session curry
@curry
def f(x, y, z): return x + y + z

@curry
def g(x, y): return [x] * y
#+end_src

#+results:

#+latex: \columnbreak
#+begin_src python :session curry
assert(   (g * f(3, 1))(9, 4)
       == (f(3, 1) >> g)(9, 4)
       == [13, 13, 13, 13])

assert (   ['a', 'a', 'b']
        == 2 >> g('a')
             >> curry(lambda x: x + ['b']))
#+end_src

#+results:
#+end_parallel

